{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 4, "batch_input_shape": [null, 176, 176, 1], "activity_regularizer": null, "strides": [1, 1], "trainable": true, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "padding": "valid", "activation": "relu", "name": "conv2d_1", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Conv2D", "config": {"filters": 4, "batch_input_shape": [null, 176, 176, 1], "activity_regularizer": null, "strides": [1, 1], "trainable": true, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "padding": "valid", "activation": "relu", "name": "conv2d_2", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "units": 8, "activation": "relu", "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "units": 1, "activation": "sigmoid", "name": "dense_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}], "keras_version": "2.0.8"}