{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "name": "conv2d_1", "activation": "relu", "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 176, 176, 1], "dtype": "float32", "activity_regularizer": null, "filters": 12, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "name": "conv2d_2", "activation": "relu", "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "filters": 8, "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "units": 16, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_2", "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "softmax", "kernel_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "bias_constraint": null, "units": 2, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true}}], "keras_version": "2.1.3", "backend": "tensorflow"}