{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.3", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "batch_input_shape": [null, 176, 176, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "use_bias": true, "padding": "valid", "filters": 32, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "name": "conv2d_1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "bias_regularizer": null, "trainable": true, "name": "dense_1", "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}}}]}