{"keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 6, "kernel_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "activation": "relu", "padding": "valid", "trainable": true, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "batch_input_shape": [null, 176, 176, 1], "activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "name": "conv2d_1"}}, {"class_name": "Conv2D", "config": {"filters": 4, "kernel_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "activation": "relu", "padding": "valid", "trainable": true, "dtype": "float32", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "batch_input_shape": [null, 176, 176, 1], "activity_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "data_format": "channels_last", "use_bias": true, "name": "conv2d_2"}}, {"class_name": "Dropout", "config": {"rate": 0.1, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "units": 8, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"rate": 0.1, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_regularizer": null, "activation": "sigmoid", "units": 1, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_2"}}]}