{"keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "dtype": "float32", "activity_regularizer": null, "name": "conv2d_1", "use_bias": true, "trainable": true, "batch_input_shape": [null, 176, 176, 1], "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "padding": "valid", "kernel_constraint": null, "kernel_size": [3, 3], "filters": 12, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "activation": "relu", "name": "conv2d_2", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "padding": "valid", "kernel_constraint": null, "kernel_size": [3, 3], "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "relu", "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "units": 16, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "activation": "softmax", "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "units": 2, "bias_constraint": null}}]}