{"backend": "tensorflow", "keras_version": "2.1.3", "config": [{"class_name": "Conv2D", "config": {"filters": 12, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 176, 176, 1], "kernel_size": [3, 3], "bias_constraint": null, "activation": "relu", "dtype": "float32", "use_bias": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "name": "conv2d_1"}}, {"class_name": "Conv2D", "config": {"filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "relu", "name": "conv2d_2", "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "use_bias": true, "units": 16, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "sigmoid", "use_bias": true, "units": 1, "name": "dense_2", "bias_constraint": null, "activity_regularizer": null}}], "class_name": "Sequential"}