{"keras_version": "2.1.3", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "batch_input_shape": [null, 176, 176, 1], "data_format": "channels_last", "bias_regularizer": null, "filters": 32, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "kernel_size": [5, 5], "use_bias": true, "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "valid", "data_format": "channels_last", "bias_regularizer": null, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_size": [5, 5], "use_bias": true, "strides": [1, 1], "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "name": "conv2d_2", "activation": "relu", "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "units": 64, "trainable": true, "activity_regularizer": null, "name": "dense_1", "activation": "sigmoid", "bias_constraint": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "use_bias": true, "units": 1, "trainable": true, "activity_regularizer": null, "name": "dense_2", "activation": "sigmoid", "bias_constraint": null}}], "class_name": "Sequential"}