{"backend": "tensorflow", "keras_version": "2.1.3", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv2d_1", "padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 12, "batch_input_shape": [null, 176, 176, 1], "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "data_format": "channels_last", "name": "conv2d_2", "padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "relu", "filters": 8, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.25, "trainable": true, "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_1", "units": 16, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "rate": 0.5, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_2", "units": 2, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}