{"config": [{"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "batch_input_shape": [null, 90, 90, 1], "dtype": "float32", "kernel_size": [5, 5], "name": "conv2d_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "use_bias": true, "filters": 12, "padding": "valid", "dilation_rate": [1, 1], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [5, 5], "name": "conv2d_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "use_bias": true, "filters": 4, "padding": "valid", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_3", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "use_bias": true, "filters": 2, "padding": "valid", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "name": "conv2d_4", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "use_bias": true, "filters": 4, "padding": "valid", "dilation_rate": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.25, "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "activation": "relu", "units": 16, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "activation": "sigmoid", "units": 2, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null}}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.3"}