{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "strides": [1, 1], "use_bias": true, "batch_input_shape": [null, 176, 176, 1], "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "dtype": "float32", "bias_constraint": null, "filters": 12, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "name": "conv2d_1"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "strides": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "filters": 8, "kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "name": "conv2d_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "sigmoid", "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "sigmoid", "kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1}}]}