{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "name": "conv2d_1", "batch_input_shape": [null, 176, 176, 1], "dtype": "float32", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_size": [5, 5], "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_constraint": null, "padding": "valid", "filters": 8}}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "name": "conv2d_2", "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "valid", "filters": 4}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 4}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "trainable": true, "noise_shape": null, "rate": 0.2}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "use_bias": true, "name": "dense_2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 1}}], "keras_version": "2.1.3"}