{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "filters": 6, "kernel_regularizer": null, "name": "conv2d_1", "kernel_constraint": null, "padding": "valid", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "batch_input_shape": [null, 176, 176, 1], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dtype": "float32", "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "relu", "filters": 6, "kernel_regularizer": null, "name": "conv2d_2", "kernel_constraint": null, "padding": "valid", "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "batch_input_shape": [null, 176, 176, 1], "data_format": "channels_last", "bias_constraint": null, "trainable": true, "dtype": "float32", "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "units": 8, "name": "dense_1", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "units": 1, "name": "dense_2", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activation": "sigmoid", "trainable": true}}]}