{"keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_regularizer": null, "dtype": "float32", "name": "conv2d_1", "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "batch_input_shape": [null, 176, 176, 1], "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 12, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "conv2d_2", "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.25, "name": "dropout_1", "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "units": 16, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "rate": 0.5, "name": "dropout_2", "noise_shape": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "units": 2, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}}}]}