{"class_name": "Sequential", "keras_version": "2.1.3", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 30976], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_16", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_17", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_18", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_19", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_20", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_21", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_22", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_23", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_24", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 64, "bias_regularizer": null, "name": "dense_25", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"units": 1, "bias_regularizer": null, "name": "dense_26", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}}]}