{"keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "filters": 12, "trainable": true, "activation": "relu", "strides": [1, 1], "batch_input_shape": [null, 176, 176, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "name": "conv2d_1", "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 4, "dilation_rate": [1, 1], "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_2", "trainable": true, "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 2, "dilation_rate": [1, 1], "activation": "relu", "strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "name": "conv2d_3", "trainable": true, "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "rate": 0.25, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "relu", "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "softmax", "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}}]}