{"config": [{"config": {"dilation_rate": [1, 1], "trainable": true, "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "filters": 12, "name": "conv2d_1", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [39, 39], "use_bias": true, "bias_regularizer": null, "padding": "valid", "batch_input_shape": [null, 176, 176, 1]}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "filters": 4, "name": "conv2d_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [39, 39], "use_bias": true, "bias_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "data_format": "channels_last", "kernel_regularizer": null, "kernel_constraint": null, "filters": 2, "name": "conv2d_3", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_size": [39, 39], "use_bias": true, "bias_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "units": 16}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "units": 2}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Sequential"}