{"keras_version": "2.1.3", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 176, 176, 1], "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "name": "conv2d_1", "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "dtype": "float32", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_2", "activation": "relu", "kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "filters": 16, "bias_regularizer": null, "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_1", "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 32, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_2", "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "units": 1, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null}}], "backend": "tensorflow"}