{"keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "conv2d_1", "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dtype": "float32", "batch_input_shape": [null, 176, 176, 1], "trainable": true, "activity_regularizer": null, "filters": 64, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "conv2d_2", "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "dtype": "float32", "batch_input_shape": [null, 176, 176, 1], "trainable": true, "activity_regularizer": null, "filters": 32, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [5, 5], "kernel_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "trainable": true, "activity_regularizer": null, "filters": 16}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.25}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "units": 64, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "units": 1, "kernel_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true}}]}