{"keras_version": "2.1.3", "backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "data_format": "channels_last", "dtype": "float32", "filters": 8, "use_bias": true, "strides": [1, 1], "batch_input_shape": [null, 176, 176, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "trainable": true, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "data_format": "channels_last", "filters": 2, "use_bias": true, "strides": [1, 1], "name": "conv2d_2", "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 16, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_2", "seed": null, "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 1, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}