{"config": [{"config": {"filters": 12, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_size": [5, 5], "padding": "valid", "batch_input_shape": [null, 176, 176, 1], "trainable": true, "strides": [1, 1], "use_bias": true, "name": "conv2d_1", "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"filters": 4, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_size": [5, 5], "padding": "valid", "trainable": true, "strides": [1, 1], "use_bias": true, "name": "conv2d_2", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"filters": 2, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "trainable": true, "strides": [1, 1], "use_bias": true, "name": "conv2d_3", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"filters": 4, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "trainable": true, "strides": [1, 1], "use_bias": true, "name": "conv2d_4", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "name": "dense_1", "trainable": true, "use_bias": true, "units": 16, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "seed": null, "trainable": true, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "name": "dense_2", "trainable": true, "use_bias": true, "units": 2, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "sigmoid"}, "class_name": "Dense"}], "keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow"}