{"config": [{"config": {"name": "conv2d_1", "filters": 5, "activation": "relu", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activity_regularizer": null, "data_format": "channels_last", "padding": "valid", "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1], "batch_input_shape": [null, 176, 176, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_2", "filters": 5, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_3", "filters": 5, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "units": 6, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}