{"keras_version": "2.1.3", "config": [{"config": {"data_format": "channels_last", "strides": [1, 1], "batch_input_shape": [null, 176, 176, 1], "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "activation": "relu", "use_bias": true, "filters": 12}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "activation": "relu", "use_bias": true, "filters": 4}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "activation": "relu", "use_bias": true, "filters": 2}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "padding": "valid", "activation": "relu", "use_bias": true, "filters": 8}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "noise_shape": null, "rate": 0.25, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "units": 16, "activation": "relu", "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "noise_shape": null, "rate": 0.5, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "units": 2, "activation": "softmax", "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}