{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "valid", "filters": 12, "dilation_rate": [1, 1], "batch_input_shape": [null, 176, 176, 1], "activation": "relu", "data_format": "channels_last", "name": "conv2d_1", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "activity_regularizer": null, "padding": "valid", "filters": 8, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "name": "conv2d_2", "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "units": 16, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "use_bias": true, "activation": "relu", "name": "dense_1", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2", "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "units": 2, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "use_bias": true, "activation": "sigmoid", "name": "dense_2", "kernel_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.1.3"}