{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "filters": 12, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "padding": "valid", "data_format": "channels_last", "batch_input_shape": [null, 90, 90, 1], "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_size": [5, 5], "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "filters": 4, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_2", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "filters": 2, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_3", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "filters": 4, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_4", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "units": 16, "name": "dense_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "units": 2, "name": "dense_2", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}