{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "bias_constraint": null, "dtype": "float32", "filters": 12, "dilation_rate": [1, 1], "activity_regularizer": null, "batch_input_shape": [null, 176, 176, 1], "data_format": "channels_last", "name": "conv2d_1", "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"activation": "relu", "bias_constraint": null, "filters": 8, "activity_regularizer": null, "use_bias": true, "data_format": "channels_last", "dilation_rate": [1, 1], "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [3, 3], "strides": [1, 1], "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_constraint": null, "units": 16, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "seed": null, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_constraint": null, "units": 2, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "kernel_constraint": null}}], "keras_version": "2.1.3"}