{"config": [{"config": {"kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "units": 512, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 8100]}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 512, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_3", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 256, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_4", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 256, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_5", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 256, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_6", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 256, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_7", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 256, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_8", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 128, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_9", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 128, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_10", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 128, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_11", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 128, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_12", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 64, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_13", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 64, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_14", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 64, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_15", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 64, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_16", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 32, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_17", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 32, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_18", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 32, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_19", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 32, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_20", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 16, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_21", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 16, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_22", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 16, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_23", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 16, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_24", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 16, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_25", "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 8, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_26", "bias_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 1, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow"}