{"config": [{"class_name": "Conv2D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 4, "data_format": "channels_last", "trainable": true, "padding": "valid", "activation": "relu", "dtype": "float32", "kernel_size": [39, 39], "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "batch_input_shape": [null, 176, 176, 1], "kernel_constraint": null, "name": "conv2d_1", "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 4, "data_format": "channels_last", "trainable": true, "padding": "valid", "activation": "relu", "dtype": "float32", "kernel_size": [39, 39], "strides": [1, 1], "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "batch_input_shape": [null, 176, 176, 1], "kernel_constraint": null, "name": "conv2d_2", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "units": 8, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "units": 1, "activation": "sigmoid", "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "bias_constraint": null}}], "class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow"}