{"keras_version": "2.1.3", "backend": "tensorflow", "config": [{"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "name": "conv2d_1", "batch_input_shape": [null, 176, 176, 1], "activity_regularizer": null, "dtype": "float32", "filters": 8, "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_constraint": null, "kernel_size": [5, 5], "padding": "valid", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "conv2d_2", "activity_regularizer": null, "filters": 4, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_constraint": null, "kernel_size": [5, 5], "padding": "valid", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "units": 12, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "dense_2", "activity_regularizer": null, "kernel_regularizer": null, "units": 6, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "rate": 0.5, "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "name": "dense_3", "activity_regularizer": null, "kernel_regularizer": null, "units": 1, "bias_constraint": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}