{"keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "dtype": "float32", "filters": 12, "batch_input_shape": [null, 176, 176, 1], "padding": "valid", "name": "conv2d_1", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "filters": 4, "activity_regularizer": null, "padding": "valid", "name": "conv2d_2", "kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "filters": 2, "activity_regularizer": null, "padding": "valid", "name": "conv2d_3", "kernel_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 16}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "name": "dense_2", "kernel_constraint": null, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1}}]}