{"keras_version": "2.1.3", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_1", "use_bias": true, "data_format": "channels_last", "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 12, "dtype": "float32", "batch_input_shape": [null, 176, 176, 1], "strides": [1, 1], "bias_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_2", "use_bias": true, "data_format": "channels_last", "padding": "valid", "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 8, "strides": [1, 1], "bias_regularizer": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1", "use_bias": true, "units": 16, "activity_regularizer": null, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_2", "use_bias": true, "units": 2, "activity_regularizer": null, "bias_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}