{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_1", "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 12, "batch_input_shape": [null, 176, 176, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_2", "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 4, "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_3", "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 2, "activation": "relu", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 16, "activation": "relu", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "noise_shape": null, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "units": 2, "activation": "softmax", "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.1.3"}