{"config": [{"config": {"kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "relu", "name": "conv2d_5", "padding": "valid", "batch_input_shape": [null, 176, 176, 1], "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "flatten_5", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_5", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "units": 1, "activity_regularizer": null, "activation": "sigmoid"}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.1.3", "class_name": "Sequential"}