{"backend": "tensorflow", "config": [{"config": {"bias_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 90, 90, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "activation": "relu", "filters": 16, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "use_bias": true, "bias_constraint": null, "dtype": "float32", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "activation": "relu", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "trainable": true, "filters": 16, "bias_constraint": null, "use_bias": true, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.3}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_regularizer": null, "activation": "sigmoid", "trainable": true, "units": 32, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_2", "rate": 0.3}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_regularizer": null, "activation": "sigmoid", "trainable": true, "units": 1, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}], "keras_version": "2.1.3", "class_name": "Sequential"}