{"keras_version": "2.1.3", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "activation": "relu", "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "kernel_constraint": null, "batch_input_shape": [null, 176, 176, 1], "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "dtype": "float32", "filters": 12, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "valid", "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "activation": "relu", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "filters": 8, "use_bias": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true}}]}