{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_regularizer": null, "trainable": true, "name": "conv2d_1", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 32, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "batch_input_shape": [null, 176, 176, 1], "dtype": "float32", "dilation_rate": [1, 1], "bias_constraint": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "bias_regularizer": null, "trainable": true, "name": "conv2d_2", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 16, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_1", "rate": 0.3}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "name": "dense_1", "kernel_regularizer": null, "activation": "sigmoid", "units": 32, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "name": "dropout_2", "rate": 0.3}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "name": "dense_2", "kernel_regularizer": null, "activation": "sigmoid", "units": 1, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null}}], "keras_version": "2.1.3"}